# Taps	
tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'git'
brew 'ncdu'
brew 'node'
brew 'wget'
brew 'streamripper'
brew 'youtube-dl'

# Development
brew 'mackup'
brew 'php', args: ['with-openssl']
brew 'mysql'
brew 'redis'
brew 'zsh-syntax-highlighting'  
brew 'yarn'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'wp-cli'

# Apps
cask '1password'
cask 'anydesk'
cask 'appcleaner'
cask 'avg-antivirus'
cask 'caffeine'
cask 'clockify'
cask 'calibre'
cask 'cyberduck'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'docker'
cask 'epubquicklook'
cask 'etcher'
cask 'etcher'
cask 'firefox'
cask 'gitkraken'
cask 'glance'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'hyper'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'keybase'
cask 'raspberry-pi-imager'
cask 'sequel-pro-nightly'
cask 'shotcut'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'betterzip'        # preview zip archives
cask 'epubquicklook'    # preview zip archives
cask 'qlcolorcode'      # preview source code files with syntax highlighting
cask 'qlimagesize'      # display image size and resolution
cask 'qlmarkdown'       # preview Markdown files
cask 'qlprettypatch'    # preview diff patches
cask 'quicklook-json'   # preview JSON files
cask 'quicklook-csv'    # preview CSV files
cask 'qlstephen'        # preview plain text files without or with unknown file extension
cask 'webpquicklook'    # preview Webp images

# Fonts
cask 'font-fira-code'
