# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'mas'
brew 'ncdu'
brew 'mackup'
brew 'node'
brew 'wget'

# Development
brew 'php71', args: ['with-debug']
brew 'mariadb'
brew 'redis'
brew 'zsh-syntax-highlighting'  

# Apps
cask 'avira-antivirus'
cask 'appcleaner'
cask 'dropbox'
cask 'filezilla'
cask 'firefox'
cask 'flux' 
cask 'iterm2'
cask 'google-chrome'
cask 'google-drive'
cask 'insomnia'
cask 'keybase'  
cask 'medis' 
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-meslo-lg-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-mono-for-powerline'
cask 'font-awesome-terminal-fonts'

# Install Mac App Store apps
mas 'Twitter', id: 409789998  